#include <reg52.h>

sbit  out = P1^0;              //舵机信号线
sbit  K1  = P1^4;
sbit  K2  = P1^5;
sbit  K3  = P1^6;

char code reserve[3]_at_ 0x3b; //保留0x3b开始的3个字节

/**********************************************************

us延时子函数 (500us)

**********************************************************/
void delayus(unsigned int x) // 延时毫秒级
{
	unsigned int a=0,b=0,c=0;
	for(a=x;a>0;a--)
	for(b=5;b>0;b--)
	for(c=64;c>0;c--);
}

/**********************************************************

归中子函数 （0度）

**********************************************************/
void  Prog0(void)
{
   unsigned char m;

   for(m=0; m<30; m++)
   {
     out = 1;
     delayus(3);           //延时1.5ms
     out = 0;
     delayus(37);          //延时18.5ms
   }
}

/**********************************************************

逆时针转动子函数  1ms

**********************************************************/
void  Prog1(void)
{
   unsigned char m;
   
   for(m=0; m<40; m++)
   {
     out = 1;             //延时1ms
     delayus(2);
     out = 0;
     delayus(38);        //延时19ms
   }
}
/**********************************************************

顺时针转动子函数 2ms

**********************************************************/
void  Prog2(void)
{
   unsigned char m;
   
   for(m=0; m<40; m++)
   {
     out = 1;
     delayus(4);           //延时2ms
     out = 0;
     delayus(36);          //延时18ms
   }
}
/**********************************************************

主函数

**********************************************************/
void  main(void)
{
  	while(1)
	{
		Prog2();               //0度位置
	}
}

